
## Plan Result (stg)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 9 to add, 2 to change, 8 to destroy.</code></pre>

* Create
  * module.postgresql_flexible[0].terraform_data.trigger_password_reset
  * module.sa-dets-standard.azapi_update_resource.defender_settings
  * module.sa-dets-standard.azurerm_private_endpoint.this[0]
  * module.sa-dets-standard.azurerm_storage_account.storage_account
  * module.sa-dets-standard.azurerm_storage_container.container[&#34;darts-migration&#34;]
  * module.sa-dets-standard.random_string.storage_account_random_string
  * module.sa-dets-standard.time_rotating.rotate
  * module.sa-dets-standard.time_static.pim_expiry
  * module.sa-dets-standard.time_static.pim_start
* Update
  * azurerm_windows_virtual_machine.modernisation_windows[&#34;stgdartsmidmock&#34;]
  * module.sa-migration-standard[0].azurerm_storage_account.storage_account
* Delete
  * module.sa-dets-standard[0].azapi_update_resource.defender_settings
  * module.sa-dets-standard[0].azurerm_private_endpoint.this[0]
  * module.sa-dets-standard[0].azurerm_storage_account.storage_account
  * module.sa-dets-standard[0].azurerm_storage_container.container[&#34;darts-migration&#34;]
  * module.sa-dets-standard[0].random_string.storage_account_random_string
  * module.sa-dets-standard[0].time_rotating.rotate
  * module.sa-dets-standard[0].time_static.pim_expiry
  * module.sa-dets-standard[0].time_static.pim_start
* Move
  * azurerm_storage_blob.dets-st[0] => azurerm_storage_blob.dets-st


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_blob.dets-st[0] has moved to azurerm_storage_blob.dets-st
    resource "azurerm_storage_blob" "dets-st" {
        id                     = "https://stgdetsdarts.blob.core.windows.net/darts-migration/darts-dets-blob-st-stg"
        name                   = "darts-dets-blob-st-stg"
        # (9 unchanged attributes hidden)
    }

  # azurerm_windows_virtual_machine.modernisation_windows["stgdartsmidmock"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "modernisation_windows" {
        id                                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Compute/virtualMachines/stgdartsmidmock"
        name                                                   = "stgdartsmidmock"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (25 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.postgresql_flexible[0].terraform_data.trigger_password_reset will be created
  + resource "terraform_data" "trigger_password_reset" {
      + id     = (known after apply)
      + output = (known after apply)
    }

  # module.sa-dets-standard.azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = jsonencode(
            {
              + properties = {
                  + isEnabled                         = false
                  + malwareScanning                   = {
                      + onUpload = {
                          + capGBPerMonth = -1
                          + isEnabled     = false
                        }
                    }
                  + overrideSubscriptionLevelSettings = true
                  + sensitiveDataDiscovery            = {
                      + isEnabled = false
                    }
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.sa-dets-standard.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "stgdetsdarts"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "darts-stg-rg"
      + subnet_id                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/private-endpoints"
      + tags                     = {
          + "application"         = "darts"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "staging"
          + "managedBy"           = "Darts Modernisation"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "stgdetsdarts"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.sa-dets-standard.azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = true
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "stgdetsdarts"
      + nfsv3_enabled                      = true
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "darts-stg-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "application"         = "darts"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "staging"
          + "managedBy"           = "Darts Modernisation"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false

          + container_delete_retention_policy {
              + days = 7
            }

          + delete_retention_policy {
              + days                     = 365
              + permanent_delete_enabled = false
            }
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.sa-dets-standard.azurerm_storage_container.container["darts-migration"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "darts-migration"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "stgdetsdarts"
    }

  # module.sa-dets-standard.random_string.storage_account_random_string will be created
  + resource "random_string" "storage_account_random_string" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.sa-dets-standard.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.sa-dets-standard.time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.sa-dets-standard.time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.sa-dets-standard[0].azapi_update_resource.defender_settings will be destroyed
  # (because module.sa-dets-standard[0] is not in configuration)
  - resource "azapi_update_resource" "defender_settings" {
      - body                    = jsonencode(
            {
              - properties = {
                  - isEnabled                         = false
                  - malwareScanning                   = {
                      - onUpload = {
                          - capGBPerMonth = -1
                          - isEnabled     = false
                        }
                    }
                  - overrideSubscriptionLevelSettings = true
                  - sensitiveDataDiscovery            = {
                      - isEnabled = false
                    }
                }
            }
        ) -> null
      - id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Storage/storageAccounts/stgdetsdarts/providers/Microsoft.Security/DefenderForStorageSettings/current" -> null
      - ignore_casing           = false -> null
      - ignore_missing_property = true -> null
      - name                    = "current" -> null
      - output                  = jsonencode({})
      - parent_id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Storage/storageAccounts/stgdetsdarts" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Storage/storageAccounts/stgdetsdarts/providers/Microsoft.Security/DefenderForStorageSettings/current" -> null
      - type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview" -> null
    }

  # module.sa-dets-standard[0].azurerm_private_endpoint.this[0] will be destroyed
  # (because module.sa-dets-standard[0] is not in configuration)
  - resource "azurerm_private_endpoint" "this" {
      - custom_dns_configs       = [] -> null
      - id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Network/privateEndpoints/stgdetsdarts" -> null
      - location                 = "uksouth" -> null
      - name                     = "stgdetsdarts" -> null
      - network_interface        = [
          - {
              - id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Network/networkInterfaces/stgdetsdarts.nic.6748d6ad-1903-40b3-b95b-abc915a9568f"
              - name = "stgdetsdarts.nic.6748d6ad-1903-40b3-b95b-abc915a9568f"
            },
        ] -> null
      - private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Network/privateEndpoints/stgdetsdarts/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.blob.core.windows.net"
              - name                = "privatelink.blob.core.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "stgdetsdarts.privatelink.blob.core.windows.net"
                      - ip_addresses = [
                          - "10.148.36.7",
                        ]
                      - name         = "stgdetsdarts"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> null
      - resource_group_name      = "darts-stg-rg" -> null
      - subnet_id                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/private-endpoints" -> null
      - tags                     = {
          - "application"         = "darts"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#darts-devs"
          - "environment"         = "staging"
          - "managedBy"           = "Darts Modernisation"
        } -> null

      - private_dns_zone_group {
          - id                   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Network/privateEndpoints/stgdetsdarts/privateDnsZoneGroups/endpoint-dnszonegroup" -> null
          - name                 = "endpoint-dnszonegroup" -> null
          - private_dns_zone_ids = [
              - "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ] -> null
        }

      - private_service_connection {
          - is_manual_connection           = false -> null
          - name                           = "stgdetsdarts" -> null
          - private_connection_resource_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Storage/storageAccounts/stgdetsdarts" -> null
          - private_ip_address             = "10.148.36.7" -> null
          - subresource_names              = [
              - "blob",
            ] -> null
        }
    }

  # module.sa-dets-standard[0].azurerm_storage_account.storage_account will be destroyed
  # (because module.sa-dets-standard[0] is not in configuration)
  - resource "azurerm_storage_account" "storage_account" {
      - access_tier                       = "Hot" -> null
      - account_kind                      = "StorageV2" -> null
      - account_replication_type          = "ZRS" -> null
      - account_tier                      = "Standard" -> null
      - allow_nested_items_to_be_public   = false -> null
      - cross_tenant_replication_enabled  = true -> null
      - default_to_oauth_authentication   = false -> null
      - dns_endpoint_type                 = "Standard" -> null
      - enable_https_traffic_only         = true -> null
      - id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Storage/storageAccounts/stgdetsdarts" -> null
      - infrastructure_encryption_enabled = false -> null
      - is_hns_enabled                    = true -> null
      - local_user_enabled                = true -> null
      - location                          = "uksouth" -> null
      - min_tls_version                   = "TLS1_2" -> null
      - name                              = "stgdetsdarts" -> null
      - nfsv3_enabled                     = true -> null
      - primary_access_key                = (sensitive value) -> null
      - primary_blob_connection_string    = (sensitive value) -> null
      - primary_blob_endpoint             = "https://stgdetsdarts.blob.core.windows.net/" -> null
      - primary_blob_host                 = "stgdetsdarts.blob.core.windows.net" -> null
      - primary_connection_string         = (sensitive value) -> null
      - primary_dfs_endpoint              = "https://stgdetsdarts.dfs.core.windows.net/" -> null
      - primary_dfs_host                  = "stgdetsdarts.dfs.core.windows.net" -> null
      - primary_file_endpoint             = "https://stgdetsdarts.file.core.windows.net/" -> null
      - primary_file_host                 = "stgdetsdarts.file.core.windows.net" -> null
      - primary_location                  = "uksouth" -> null
      - primary_queue_endpoint            = "https://stgdetsdarts.queue.core.windows.net/" -> null
      - primary_queue_host                = "stgdetsdarts.queue.core.windows.net" -> null
      - primary_table_endpoint            = "https://stgdetsdarts.table.core.windows.net/" -> null
      - primary_table_host                = "stgdetsdarts.table.core.windows.net" -> null
      - primary_web_endpoint              = "https://stgdetsdarts.z33.web.core.windows.net/" -> null
      - primary_web_host                  = "stgdetsdarts.z33.web.core.windows.net" -> null
      - public_network_access_enabled     = true -> null
      - queue_encryption_key_type         = "Service" -> null
      - resource_group_name               = "darts-stg-rg" -> null
      - secondary_access_key              = (sensitive value) -> null
      - secondary_connection_string       = (sensitive value) -> null
      - sftp_enabled                      = false -> null
      - shared_access_key_enabled         = true -> null
      - table_encryption_key_type         = "Service" -> null
      - tags                              = {
          - "application"         = "darts"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#darts-devs"
          - "environment"         = "staging"
          - "managedBy"           = "Darts Modernisation"
        } -> null

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null

          - container_delete_retention_policy {
              - days = 7 -> null
            }

          - delete_retention_policy {
              - days                     = 365 -> null
              - permanent_delete_enabled = false -> null
            }
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Deny" -> null
          - ip_rules                   = [
              - "86.176.100.211",
            ] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # module.sa-dets-standard[0].azurerm_storage_container.container["darts-migration"] will be destroyed
  # (because module.sa-dets-standard[0] is not in configuration)
  - resource "azurerm_storage_container" "container" {
      - container_access_type             = "private" -> null
      - default_encryption_scope          = "$account-encryption-key" -> null
      - encryption_scope_override_enabled = true -> null
      - has_immutability_policy           = false -> null
      - has_legal_hold                    = false -> null
      - id                                = "https://stgdetsdarts.blob.core.windows.net/darts-migration" -> null
      - metadata                          = {} -> null
      - name                              = "darts-migration" -> null
      - resource_manager_id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Storage/storageAccounts/stgdetsdarts/blobServices/default/containers/darts-migration" -> null
      - storage_account_name              = "stgdetsdarts" -> null
    }

  # module.sa-dets-standard[0].random_string.storage_account_random_string will be destroyed
  # (because module.sa-dets-standard[0] is not in configuration)
  - resource "random_string" "storage_account_random_string" {
      - id          = "q1tqs4okmravp3fjx4dh58r5" -> null
      - length      = 24 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "q1tqs4okmravp3fjx4dh58r5" -> null
      - special     = false -> null
      - upper       = false -> null
    }

  # module.sa-dets-standard[0].time_rotating.rotate will be destroyed
  # (because module.sa-dets-standard[0] is not in configuration)
  - resource "time_rotating" "rotate" {
      - day              = 21 -> null
      - hour             = 15 -> null
      - id               = "2024-06-26T15:51:13Z" -> null
      - minute           = 51 -> null
      - month            = 6 -> null
      - rfc3339          = "2024-06-26T15:51:13Z" -> null
      - rotation_days    = 360 -> null
      - rotation_rfc3339 = "2025-06-21T15:51:13Z" -> null
      - second           = 13 -> null
      - unix             = 1750521073 -> null
      - year             = 2025 -> null
    }

  # module.sa-dets-standard[0].time_static.pim_expiry will be destroyed
  # (because module.sa-dets-standard[0] is not in configuration)
  - resource "time_static" "pim_expiry" {
      - day     = 21 -> null
      - hour    = 15 -> null
      - id      = "2025-06-21T15:51:13Z" -> null
      - minute  = 51 -> null
      - month   = 6 -> null
      - rfc3339 = "2025-06-21T15:51:13Z" -> null
      - second  = 13 -> null
      - unix    = 1750521073 -> null
      - year    = 2025 -> null
    }

  # module.sa-dets-standard[0].time_static.pim_start will be destroyed
  # (because module.sa-dets-standard[0] is not in configuration)
  - resource "time_static" "pim_start" {
      - day     = 26 -> null
      - hour    = 15 -> null
      - id      = "2024-06-26T15:51:13Z" -> null
      - minute  = 51 -> null
      - month   = 6 -> null
      - rfc3339 = "2024-06-26T15:51:13Z" -> null
      - second  = 13 -> null
      - unix    = 1719417073 -> null
      - year    = 2024 -> null
    }

  # module.sa-migration-standard[0].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsmig02"
        name                              = "sastgdartsmig02"
        tags                              = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (39 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "86.176.100.211",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 9 to add, 2 to change, 8 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":260,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->